{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["activation_3", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 32, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "name": "dense_1", "activity_regularizer": null, "units": 64, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "name": "dense_2", "activity_regularizer": null, "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}, "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "sigmoid"}, "name": "activation_3"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}